# Уравнение Кадомцева-Петвиашвили.

Кураторы: [Прокофьев Вадим] (mailto:vadprokofev@gmail.com)

Пререквизиты: Умение дифференцировать, интегрировать, начальное знание линейной алгебры.
Мы рассмотрим уравнение Кортевега де Фриза и его обобщение в виде уравнения Кадомцева Петвиашвили.  В данной теме мы рассмотрим эти уравнения с разных сторон и на их примере увидим важные аспекты, актуальные для многих интегрируемых систем. Естественной переменной, для уравнения КП является тау-функция. Через нее удобно переписывать само уравнение и кроме того его решение часто принимает наиболее удобный вид именно в терминах тау-функции. Кроме того интегрируемые уравнения появляются не сами по себе, а в виде иерархий уравнений на бесконечный набор времен, однако, существуют способы записать их в компактном виде. Помимо этого в последнем докладе мы рассмотрим широкий класс решений иерархии КП, которые связаны с солитонами и механическими интегрируемыми системами типа Руйсенаарса.

Уравнения КдВ и КП, в билинейной форме через тау-функцию. Производная Хироты. Односолитонное и многосолитонные решения. [H. Гл.1,3, МДД гл.3]
Алгебра псевдодифференциальных операторов. Уравнения КдВ и КП как уравнение Лакса. Функция Бейкера Ахиезера как решение линейной задачи. Многосолитонные решения иерархии. [Z гл. 2,3], [МДД, гл 2,3], [D гл. 2, 5], [WS гл 2]
Интегральное уравнение Хироты для иерархии КП. Вывод дифференциальных уравнений иерархии. Разностное уравнение  Хироты и его эквивалентность всей иерархии.[Z гл 2], [D гл. 6], [WS гл 2]
Почти переплетающиеся матрицы как решение иерархии КП.  Многосолитонное решения. Связь механическими интегрируемыми системами. [KG]

Литература:
[H] “The direct Method in soliton theory” R. Hirota
[МДД] “Солитоны: дифференциальные уравнения, симметрии и бесконечномерные алгебры” Т. Мива, М. Джимбо, Э. Дате 
[D] “Soliton equations and Hamiltonian systems” L. Dickey
[Z] “Lectures on nonlinear integrable equations and their solutions” A. Zabrodin
[WS] “Sato theory and Transformation Groups. A Unified Approach to integrable systems” R. Willox, J. Satsumo
[KG] “Solitons and “almost intertwining” matrices” A. Kasman, M. Gekhtman
